puts 1 + 4
puts -6 + 13
puts 10 - 6
puts 3 * 4
puts 3 * 4 * 5

# PEMDAS - это обычная правила математики . можно ставить скобки чтобы изменять порядок подсчета
# Parentheses, Exponents, Multiplication, Division, Addition, Subtraction
puts (2 + 3) * 5

puts 10 / 5
puts 12 / 5 #  выводит 2 - так как отрезает дробную часть

puts 12.0 / 5 # выведет 2.4 - дробное число 
puts 12 / 5.0 # аналогично 2.4 - дробное число 
puts 12.0 / 5.0 # аналогично 2.4 - дробное число 

puts 0.5 / 2 # вывод 0.25 - дробное

puts 5 % 2 # выводит остаток от операции деления - в данном случае 1
puts 7 % 2 # остаток 1
puts 6 % 2 # остаток 0 - выводит 0